In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
a = ['adi ','abhi','amey','bhande']
c = [3,1,9,11]

In [2]:
pd.Series(a,c)

NameError: name 'a' is not defined

In [4]:
np.random.seed(101)

In [2]:
df = pd.DataFrame(randn(5,5),['A','B','C','D','E'])

In [3]:
df

          0         1         2         3         4
A -1.597051 -1.003783  0.561093 -1.563709 -0.348439
B -1.331629 -0.493851 -1.159704 -0.773220 -1.354204
C  0.491716  0.922210 -0.861142  1.043683 -0.271811
D -0.826314 -0.756776  0.952849  0.615210 -0.263054
E  0.856218  2.348421  0.031917  0.350387 -0.110543

In [4]:
df[5]=df[1]+df[0]

In [5]:
df.drop(5,axis=1)

          0         1         2         3         4
A -1.597051 -1.003783  0.561093 -1.563709 -0.348439
B -1.331629 -0.493851 -1.159704 -0.773220 -1.354204
C  0.491716  0.922210 -0.861142  1.043683 -0.271811
D -0.826314 -0.756776  0.952849  0.615210 -0.263054
E  0.856218  2.348421  0.031917  0.350387 -0.110543

In [6]:
df.loc[['A','B'],[0,1]]

          0         1
A -1.597051 -1.003783
B -1.331629 -0.493851

In [7]:
df

          0         1         2         3         4         5
A -1.597051 -1.003783  0.561093 -1.563709 -0.348439 -2.600834
B -1.331629 -0.493851 -1.159704 -0.773220 -1.354204 -1.825481
C  0.491716  0.922210 -0.861142  1.043683 -0.271811  1.413926
D -0.826314 -0.756776  0.952849  0.615210 -0.263054 -1.583090
E  0.856218  2.348421  0.031917  0.350387 -0.110543  3.204639

In [8]:
df[(df[2]<0) | (df[4]<0)]

          0         1         2         3         4         5
A -1.597051 -1.003783  0.561093 -1.563709 -0.348439 -2.600834
B -1.331629 -0.493851 -1.159704 -0.773220 -1.354204 -1.825481
C  0.491716  0.922210 -0.861142  1.043683 -0.271811  1.413926
D -0.826314 -0.756776  0.952849  0.615210 -0.263054 -1.583090
E  0.856218  2.348421  0.031917  0.350387 -0.110543  3.204639

In [9]:
df.reset_index(inplace = True)

In [10]:
newind = "a b c d e".split()

In [11]:
df['new-index']=newind

In [12]:
df.set_index('new-index')

          index         0         1         2         3         4         5
new-index
a             A -1.597051 -1.003783  0.561093 -1.563709 -0.348439 -2.600834
b             B -1.331629 -0.493851 -1.159704 -0.773220 -1.354204 -1.825481
c             C  0.491716  0.922210 -0.861142  1.043683 -0.271811  1.413926
d             D -0.826314 -0.756776  0.952849  0.615210 -0.263054 -1.583090
e             E  0.856218  2.348421  0.031917  0.350387 -0.110543  3.204639

In [13]:
df

  index         0         1         2         3         4         5 new-index
0     A -1.597051 -1.003783  0.561093 -1.563709 -0.348439 -2.600834         a
1     B -1.331629 -0.493851 -1.159704 -0.773220 -1.354204 -1.825481         b
2     C  0.491716  0.922210 -0.861142  1.043683 -0.271811  1.413926         c
3     D -0.826314 -0.756776  0.952849  0.615210 -0.263054 -1.583090         d
4     E  0.856218  2.348421  0.031917  0.350387 -0.110543  3.204639         e

In [16]:
a = "G1 G1 G1 G2 G2 G2 ".split()
b= [1,2,3,1,2,3]

In [17]:
c = (list(zip(a,b)))
heir_index = pd.MultiIndex.from_tuples(c)

In [18]:
heir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [19]:
df = pd.DataFrame(randn(6,2),heir_index,['A','B'])

In [20]:
df

             A         B
G1 1 -0.771445  0.423875
   2 -0.436575 -0.656551
   3 -0.850700 -0.430726
G2 1 -0.090882 -0.071010
   2  0.104482 -0.948180
   3  0.252322  0.228856

In [21]:
df.loc['G1'].loc[1,'A']

-0.7714448891221183

In [22]:
df.index.names = ['groups','num']

In [23]:
df

                   A         B
groups num
G1     1   -0.771445  0.423875
       2   -0.436575 -0.656551
       3   -0.850700 -0.430726
G2     1   -0.090882 -0.071010
       2    0.104482 -0.948180
       3    0.252322  0.228856

In [24]:
df.xs(1,level = 'num')

               A         B
groups
G1     -0.771445  0.423875
G2     -0.090882 -0.071010

In [39]:
arr =  np.arange(0,10)
arr= arr.reshape(5,2)

print(Arr)

['a', 'b', 'c', 'd', 'e']

In [53]:
df1 = pd.DataFrame(arr,'a b c d e'.split(),['A','B'])
df1

   A  B
a  0  1
b  2  3
c  4  5
d  6  7
e  8  9

In [69]:
pd.unique(df1['B'])

array([1, 3, 5, 7, 9], dtype=int64)